garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1764.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CLC3GLS3" edc:desc="Gate logic select register 3" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CLC3GLS3" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02286_CLC.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xF2D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LC3G4D1N" edc:desc="" edc:mask="0x1" edc:name="LC3G4D1N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G4D1T" edc:desc="" edc:mask="0x1" edc:name="LC3G4D1T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G4D2N" edc:desc="" edc:mask="0x1" edc:name="LC3G4D2N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G4D2T" edc:desc="" edc:mask="0x1" edc:name="LC3G4D2T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G4D3N" edc:desc="" edc:mask="0x1" edc:name="LC3G4D3N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G4D3T" edc:desc="" edc:mask="0x1" edc:name="LC3G4D3T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G4D4N" edc:desc="" edc:mask="0x1" edc:name="LC3G4D4N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G4D4T" edc:desc="" edc:mask="0x1" edc:name="LC3G4D4T" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="G4D1N" edc:desc="" edc:mask="0x1" edc:name="G4D1N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D1T" edc:desc="" edc:mask="0x1" edc:name="G4D1T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D2N" edc:desc="" edc:mask="0x1" edc:name="G4D2N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D2T" edc:desc="" edc:mask="0x1" edc:name="G4D2T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D3N" edc:desc="" edc:mask="0x1" edc:name="G4D3N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D3T" edc:desc="" edc:mask="0x1" edc:name="G4D3T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D4N" edc:desc="" edc:mask="0x1" edc:name="G4D4N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D4T" edc:desc="" edc:mask="0x1" edc:name="G4D4T" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="31" edc:beginaddr="0xF80" edc:endaddr="0xFF0" edc:regionid="sfr31">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xF80"/>
        <edc:AdjustPoint edc:offset="88" edc:_addr="0xF8C"/>
        <edc:SFRDef edc:access="-----nnn" edc:cname="STATUS_SHAD" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----uuu" edc:name="STATUS_SHAD" edc:nzwidth="8" edc:por="-----xxx" edc:_addr="0xFE4">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C_SHAD" edc:desc="" edc:mask="0x1" edc:name="C_SHAD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DC_SHAD" edc:desc="" edc:mask="0x1" edc:name="DC_SHAD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="Z_SHAD" edc:desc="" edc:mask="0x1" edc:name="Z_SHAD" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="WREG_SHAD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="WREG_SHAD" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_addr="0xFE5">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WREG_SHAD" edc:desc="" edc:mask="0xff" edc:name="WREG_SHAD" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="BSR_SHAD" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="BSR_SHAD" edc:nzwidth="8" edc:por="---xxxxx" edc:_addr="0xFE6">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BSR_SHAD" edc:desc="" edc:mask="0x1f" edc:name="BSR_SHAD" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="PCLATH_SHAD" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuu" edc:name="PCLATH_SHAD" edc:nzwidth="8" edc:por="-xxxxxxx" edc:_addr="0xFE7">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PCLATH_SHAD" edc:desc="" edc:mask="0x7f" edc:name="PCLATH_SHAD" edc:nzwidth="7"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="FSR0L_SHAD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="FSR0L_SHAD" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_addr="0xFE8">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FSR0L_SHAD" edc:desc="" edc:mask="0xff" edc:name="FSR0L_SHAD" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="FSR0H_SHAD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="FSR0H_SHAD" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_addr="0xFE9">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FSR0H_SHAD" edc:desc="" edc:mask="0xff" edc:name="FSR0H_SHAD" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="FSR1L_SHAD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="FSR1L_SHAD" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_addr="0xFEA">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FSR1L_SHAD" edc:desc="" edc:mask="0xff" edc:name="FSR1L_SHAD" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="FSR1H_SHAD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="FSR1H_SHAD" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_addr="0xFEB">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FSR1H_SHAD" edc:desc="" edc:mask="0xff" edc:name="FSR1H_SHAD" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0xFEC"/>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="STKPTR" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---11111" edc:name="STKPTR" edc:nzwidth="8" edc:por="---11111" edc:_addr="0xFED">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="STKPTR" edc:desc="" edc:mask="0x1f" edc:name="STKPTR" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TOSL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TOSL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_addr="0xFEE">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TOSL" edc:desc="" edc:mask="0xff" edc:name="TOSL" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="TOSH" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuu" edc:name="TOSH" edc:nzwidth="8" edc:por="-xxxxxxx" edc:_addr="0xFEF">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TOSH" edc:desc="" edc:mask="0x7f" edc:name="TOSH" edc:nzwidth="7"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:GPRDataSector edc:bank="0" edc:beginaddr="0x20" edc:endaddr="0x70" edc:regionid="gpr0"/>
      <edc:GPRDataSector edc:bank="0" edc:beginaddr="0x70" edc:endaddr="0x80" edc:regionid="gprnobank"/>
      <edc:GPRDataSector edc:bank="1" edc:beginaddr="0xA0" edc:endaddr="0xF0" edc:regionid="gpr1"/>
      <edc:GPRDataSector edc:bank="1" edc:beginaddr="0xF0" edc:endaddr="0x100" edc:regionid="gpr1s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="2" edc:beginaddr="0x120" edc:endaddr="0x170" edc:regionid="gpr2"/>
      <edc:GPRDataSector edc:bank="2" edc:beginaddr="0x170" edc:endaddr="0x180" edc:regionid="gpr2s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="3" edc:beginaddr="0x1A0" edc:endaddr="0x1F0" edc:regionid="gpr3"/>
      <edc:GPRDataSector edc:bank="3" edc:beginaddr="0x1F0" edc:endaddr="0x200" edc:regionid="gpr3s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="4" edc:beginaddr="0x220" edc:endaddr="0x270" edc:regionid="gpr4"/>
      <edc:GPRDataSector edc:bank="4" edc:beginaddr="0x270" edc:endaddr="0x280" edc:regionid="gpr4s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="5" edc:beginaddr="0x2A0" edc:endaddr="0x2F0" edc:regionid="gpr5"/>
      <edc:GPRDataSector edc:bank="5" edc:beginaddr="0x2F0" edc:endaddr="0x300" edc:regionid="gpr5s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="6" edc:beginaddr="0x320" edc:endaddr="0x330" edc:regionid="gpr6"/>
      <edc:GPRDataSector edc:bank="6" edc:beginaddr="0x370" edc:endaddr="0x380" edc:regionid="gpr6s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="7" edc:beginaddr="0x3F0" edc:endaddr="0x400" edc:regionid="gpr7s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="8" edc:beginaddr="0x470" edc:endaddr="0x480" edc:regionid="gpr8s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="9" edc:beginaddr="0x4F0" edc:endaddr="0x500" edc:regionid="gpr9s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="10" edc:beginaddr="0x570" edc:endaddr="0x580" edc:regionid="gpr10s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="11" edc:beginaddr="0x5F0" edc:endaddr="0x600" edc:regionid="gpr11s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="12" edc:beginaddr="0x670" edc:endaddr="0x680" edc:regionid="gpr12s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="13" edc:beginaddr="0x6F0" edc:endaddr="0x700" edc:regionid="gpr13s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="14" edc:beginaddr="0x770" edc:endaddr="0x780" edc:regionid="gpr14s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="15" edc:beginaddr="0x7F0" edc:endaddr="0x800" edc:regionid="gpr15s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="16" edc:beginaddr="0x870" edc:endaddr="0x880" edc:regionid="gpr16s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="17" edc:beginaddr="0x8F0" edc:endaddr="0x900" edc:regionid="gpr17s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="18" edc:beginaddr="0x970" edc:endaddr="0x980" edc:regionid="gpr18s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="19" edc:beginaddr="0x9F0" edc:endaddr="0xA00" edc:regionid="gpr19s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="20" edc:beginaddr="0xA70" edc:endaddr="0xA80" edc:regionid="gpr20s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="21" edc:beginaddr="0xAF0" edc:endaddr="0xB00" edc:regionid="gpr21s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="22" edc:beginaddr="0xB70" edc:endaddr="0xB80" edc:regionid="gpr22s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="23" edc:beginaddr="0xBF0" edc:endaddr="0xC00" edc:regionid="gpr23s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="24" edc:beginaddr="0xC70" edc:endaddr="0xC80" edc:regionid="gpr24s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="25" edc:beginaddr="0xCF0" edc:endaddr="0xD00" edc:regionid="gpr25s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="26" edc:beginaddr="0xD70" edc:endaddr="0xD80" edc:regionid="gpr26s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="27" edc:beginaddr="0xDF0" edc:endaddr="0xE00" edc:regionid="gpr27s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="28" edc:beginaddr="0xE70" edc:endaddr="0xE80" edc:regionid="gpr28s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="29" edc:beginaddr="0xEF0" edc:endaddr="0xF00" edc:regionid="gpr29s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="30" edc:beginaddr="0xF70" edc:endaddr="0xF80" edc:regionid="gpr30s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="31" edc:beginaddr="0xFF0" edc:endaddr="0x1000" edc:regionid="gpr31s" edc:shadowidref="gprnobank" edc:shadowoffset="0"/>
      <edc:EmulatorZone edc:beginaddr="0xf8c" edc:endaddr="0xfcf" edc:regionid="emulatorzone"/>
    </edc:RegardlessOfMode>
    <edc:TraditionalModeOnly/>
    <edc:ExtendedModeOnly/>
  </edc:DataSpace>
  <edc:IndirectSpace>
    <edc:LinearDataSector edc:banksize="0x80" edc:beginaddr="0x2000" edc:blockbeginaddr="0x20" edc:blockendaddr="0x70" edc:endaddr="0x29B0"/>
  </edc:IndirectSpace>
  <edc:PinList edc:desc="14-pin DIP" edc:ppsflavor="complex">
    <edc:Pin>
      <edc:VirtualPin edc:name="Vdd"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA5"/>
      <edc:VirtualPin edc:name="SOSCI"/>
      <edc:VirtualPin edc:name="OSC1"/>
      <edc:VirtualPin edc:name="CLKIN"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA4"/>
      <edc:VirtualPin edc:name="AN3"/>
      <edc:VirtualPin edc:name="SOSCO"/>
      <edc:VirtualPin edc:name="OSC2"/>
      <edc:VirtualPin edc:name="CLKOUT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA3"/>
      <edc:VirtualPin edc:name="Vpp"/>
      <edc:VirtualPin edc:name="nMCLR"/>
      <edc:VirtualPin edc:name="nICD"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC5"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC4"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC3"/>
      <edc:VirtualPin edc:name="AN7"/>
      <edc:VirtualPin edc:name="C1IN3-"/>
      <edc:VirtualPin edc:name="C2IN3-"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC2"/>
      <edc:VirtualPin edc:name="AN6"/>
      <edc:VirtualPin edc:name="OPA1OUT"/>
      <edc:VirtualPin edc:name="C1IN2-"/>
      <edc:VirtualPin edc:name="C2IN2-"/>
      <edc:VirtualPin edc:name="PRG1IN0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC1"/>
      <edc:VirtualPin edc:name="AN5"/>
      <edc:VirtualPin edc:name="OPA1IN-"/>
      <edc:VirtualPin edc:name="C1IN1-"/>
      <edc:VirtualPin edc:name="C2IN1-"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC0"/>
      <edc:VirtualPin edc:name="AN4"/>
      <edc:VirtualPin edc:name="OPA1IN+"/>
      <edc:VirtualPin edc:name="C2IN0+"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA2"/>
      <edc:VirtualPin edc:name="AN2"/>
      <edc:VirtualPin edc:name="ZCD"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA1"/>
      <edc:VirtualPin edc:name="AN1"/>
      <edc:VirtualPin edc:name="Vref+"/>
      <edc:VirtualPin edc:name="DAC1Ref+"/>
      <edc:VirtualPin edc:name="DAC3Ref+"/>
      <edc:VirtualPin edc:name="C1IN0-"/>
      <edc:VirtualPin edc:name="C2IN0-"/>
      <edc:VirtualPin edc:name="ICSPCLK"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA0"/>
      <edc:VirtualPin edc:name="AN0"/>
      <edc:VirtualPin edc:name="Vref-"/>
      <edc:VirtualPin edc:name="DAC1Ref-"/>
      <edc:VirtualPin edc:name="DAC3Ref-"/>
      <edc:VirtualPin edc:name="DAC1OUT1"/>
      <edc:VirtualPin edc:name="DAC3OUT1"/>
      <edc:VirtualPin edc:name="C1IN0+"/>
      <edc:VirtualPin edc:name="ICSPDAT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="Vss"/>
    </edc:Pin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A B C">
      <edc:VirtualPin edc:name="C1OUT" edc:ppsval="0x18"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A B C">
      <edc:VirtualPin edc:name="C2OUT" edc:ppsval="0x19"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A B C">
      <edc:VirtualPin edc:name="PWM3OUT" edc:ppsval="0x0e"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A B C">
      <edc:VirtualPin edc:name="PWM5OUT" edc:ppsval="0x10"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="bi" edc:ppsports="A B C">
      <edc:VirtualPin edc:name="CCP1" edc:ppsval="0x0c"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A B C">
      <edc:VirtualPin edc:name="COG1IN"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A B C">
      <edc:VirtualPin edc:name="COG1A" edc:ppsval="0x04"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A B C">
      <edc:VirtualPin edc:name="COG1B" edc:ppsval="0x05"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A B C">
      <edc:VirtualPin edc:name="COG1C" edc:ppsval="0x06"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A B C">
      <edc:VirtualPin edc:name="COG1D" edc:ppsval="0x07"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A B C">
      <edc:VirtualPin edc:name="CLC1OUT" edc:ppsval="0x01"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A B C">
      <edc:VirtualPin edc:name="CLC2OUT" edc:ppsval="0x02"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A B C">
      <edc:VirtualPin edc:name="CLC3OUT" edc:ppsval="0x03"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A B C">
      <edc:VirtualPin edc:name="MD1OUT" edc:ppsval="0x1C"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A B C">
      <edc:VirtualPin edc:name="RX"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A B C">
      <edc:VirtualPin edc:name="TX" edc:ppsval="0x16"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="bi" edc:ppsports="A B C">
      <edc:VirtualPin edc:name="CK"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A B C">
      <edc:VirtualPin edc:name="DT" edc:ppsval="0x17"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A B C">
      <edc:VirtualPin edc:name="SDO" edc:ppsval="0x14"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A B C">
      <edc:VirtualPin edc:name="SDI"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="bi" edc:ppsports="A B C">
      <edc:VirtualPin edc:name="SDA" edc:ppsval="0x13"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="bi" edc:ppsports="A B C">
      <edc:VirtualPin edc:name="SCK" edc:ppsval="0x12"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="bi" edc:ppsports="A B C">
      <edc:VirtualPin edc:name="SCL" edc:ppsval="0x12"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A B C">
      <edc:VirtualPin edc:name="SS"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A B C">
      <edc:VirtualPin edc:name="PRG1F"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A B C">
      <edc:VirtualPin edc:name="PRG1R"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A B C">
      <edc:VirtualPin edc:name="T0CKI"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A B C">
      <edc:VirtualPin edc:name="T1CKI"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A B C">
      <edc:VirtualPin edc:name="T2CKI"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A B C">
      <edc:VirtualPin edc:name="T3CKI"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A B C">
      <edc:VirtualPin edc:name="T4CKI"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A B C">
      <edc:VirtualPin edc:name="T5CKI"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A B C">
      <edc:VirtualPin edc:name="T6CKI"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A B C">
      <edc:VirtualPin edc:name="T1G"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A B C">
      <edc:VirtualPin edc:name="T3G"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A B C">
      <edc:VirtualPin edc:name="T5G"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A B C">
      <edc:VirtualPin edc:name="CLCIN0"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A B C">
      <edc:VirtualPin edc:name="CLCIN1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A B C">
      <edc:VirtualPin edc:name="CLCIN2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A B C">
      <edc:VirtualPin edc:name="CLCIN3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A B C">
      <edc:VirtualPin edc:name="MD1MOD"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A B C">
      <edc:VirtualPin edc:name="MD1CL"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A B C">
      <edc:VirtualPin edc:name="MD1CH"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A B C">
      <edc:VirtualPin edc:name="INT"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="T2IN"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="T4IN"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="T6IN"/>
    </edc:RemappablePin>
  </edc:PinList>
</edc:PIC>
